cf_billing/Reports/бестОтчетДляНРИЦПоЛьготникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бестОтчетДляНРИЦПоЛьготникам</Name>
		</Properties>
	</Report>
</MetaDataObject>

cf_billing/InformationRegisters/энргЖильцыЛьготныхКатегорий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЖильцыЛьготныхКатегорий</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Жилец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛьготнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЛьготныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргАвансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргАвансы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргОплатаУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргОплатаУслуг</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргАвансыПоступившие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргАвансыПоступившие</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/энргВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Reports/бестОтчетДляНРИЦПоЛьготникам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьОтчет(ТабДок, ПараметрыОтчета) Экспорт
	ТабДок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("ДатаНач", 		ПараметрыОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", 		КонецДня(ПараметрыОтчета.ДатаКонца)); 
	ГВС	= Новый Массив;
	ГВС.Добавить(ПараметрыОтчета.ТН);
	ГВС.Добавить(ПараметрыОтчета.ТЭ);
	Запрос.УстановитьПараметр("ГВС", 			ГВС);
	Запрос.УстановитьПараметр("ТН", 			ПараметрыОтчета.ТН);
	Запрос.УстановитьПараметр("Тепло", 			ПараметрыОтчета.Тепло);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Абонент,
	               |	энргАбоненты.КлючПомещения КАК КлючПомещения,
	               |	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	               |	энргАбоненты.Организация КАК Организация,
	               |	энргАбоненты.Район КАК Район,
	               |	энргАбоненты.СтарыйЛС КАК СтарыйЛС
	               |ПОМЕСТИТЬ ВрТАбоненты
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |ГДЕ
	               |	НЕ энргАбоненты.ПометкаУдаления
	               |	И энргАбоненты.Организация = &Организация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргАбоненты.Ссылка,
	               |	энргАбоненты.КлючПомещения,
	               |	энргАбоненты.ЛицевойСчет,
	               |	энргАбоненты.Организация,
	               |	энргАбоненты.Район,
	               |	энргАбоненты.СтарыйЛС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТАбоненты.Абонент КАК Абонент,
	               |	ВрТАбоненты.КлючПомещения КАК КлючПомещения,
	               |	ВрТАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВрТАбоненты.Организация КАК Организация,
	               |	ВрТАбоненты.Район КАК Район,
	               |	ВрТАбоненты.СтарыйЛС КАК СтарыйЛС
	               |ПОМЕСТИТЬ ВрТЛьготники
	               |ИЗ
	               |	ВрТАбоненты КАК ВрТАбоненты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних(&ДатаКон, Организация = &Организация) КАК Льготники
	               |		ПО ВрТАбоненты.Организация = Льготники.Организация
	               |			И ВрТАбоненты.Район = Льготники.Район
	               |			И ВрТАбоненты.Абонент = Льготники.Абонент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТАбоненты.Абонент,
	               |	ВрТАбоненты.КлючПомещения,
	               |	ВрТАбоненты.ЛицевойСчет,
	               |	ВрТАбоненты.Организация,
	               |	ВрТАбоненты.Район,
	               |	ВрТАбоненты.СтарыйЛС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТЛьготники.Абонент КАК Абонент,
	               |	ВрТЛьготники.КлючПомещения КАК КлючПомещения,
	               |	ВрТЛьготники.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВрТЛьготники.Организация КАК Организация,
	               |	ВрТЛьготники.Район КАК Район,
	               |	энргКлючиПомещений.Строение КАК Строение,
	               |	энргКлючиПомещений.Помещение КАК Помещение,
	               |	ВрТЛьготники.СтарыйЛС КАК СтарыйЛС
	               |ПОМЕСТИТЬ ВрТКлючи
	               |ИЗ
	               |	ВрТЛьготники КАК ВрТЛьготники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ПО ВрТЛьготники.КлючПомещения = энргКлючиПомещений.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТЛьготники.Абонент,
	               |	ВрТЛьготники.КлючПомещения,
	               |	ВрТЛьготники.ЛицевойСчет,
	               |	ВрТЛьготники.Организация,
	               |	ВрТЛьготники.Район,
	               |	энргКлючиПомещений.Строение,
	               |	энргКлючиПомещений.Помещение,
	               |	ВрТЛьготники.СтарыйЛС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТКлючи.Организация КАК Организация,
	               |	ВрТКлючи.Район КАК Район,
	               |	ВрТКлючи.Строение КАК МКД,
	               |	ВрТКлючи.Абонент КАК Абонент,
	               |	НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ) КАК ПериодНачисления,
	               |	ЕСТЬNULL(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток, 0) КАК Задолженность,
	               |	0 КАК НачисленоГВСРуб,
	               |	0 КАК НачисленоГВСОбъем,
	               |	0 КАК НачисленоОтоплениеРуб,
	               |	0 КАК НачисленоОтоплениеОбъем,
	               |	0 КАК ПерерасчетОтоплениеРуб,
	               |	0 КАК ПерерасчетГВСРуб,
	               |	0 КАК ПерерасчетОтоплениеОбъем,
	               |	0 КАК ПерерасчетГВСОбъем,
	               |	0 КАК ОплатаЗадолженности,
	               |	ВрТКлючи.КлючПомещения КАК КлючПомещения,
	               |	ВрТКлючи.Помещение КАК Помещение,
	               |	ВрТКлючи.СтарыйЛС КАК СтарыйЛС
	               |ПОМЕСТИТЬ ВрТ0
	               |ИЗ
	               |	ВрТКлючи КАК ВрТКлючи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(&ДатаНач, Организация = &Организация) КАК энргВзаиморасчетыПоМесяцамОстатки
	               |		ПО ВрТКлючи.Организация = энргВзаиморасчетыПоМесяцамОстатки.Организация
	               |			И ВрТКлючи.Район = энргВзаиморасчетыПоМесяцамОстатки.Район
	               |			И ВрТКлючи.Абонент = энргВзаиморасчетыПоМесяцамОстатки.Абонент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВрТКлючи.Организация,
	               |	ВрТКлючи.Район,
	               |	ВрТКлючи.Строение,
	               |	ВрТКлючи.Абонент,
	               |	НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ),
	               |	-ЕСТЬNULL(энргАвансыОстатки.СуммаОстаток, 0),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ВрТКлючи.КлючПомещения,
	               |	ВрТКлючи.Помещение,
	               |	ВрТКлючи.СтарыйЛС
	               |ИЗ
	               |	ВрТКлючи КАК ВрТКлючи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргАвансы.Остатки(&ДатаНач, Организация = &Организация) КАК энргАвансыОстатки
	               |		ПО ВрТКлючи.Организация = энргАвансыОстатки.Организация
	               |			И ВрТКлючи.Район = энргАвансыОстатки.Район
	               |			И ВрТКлючи.Абонент = энргАвансыОстатки.Абонент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВрТКлючи.Организация,
	               |	ВрТКлючи.Район,
	               |	ВрТКлючи.Строение,
	               |	ВрТКлючи.Абонент,
	               |	энргОбъемНачисленийОбороты.ПериодНачисления,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.Услуга В (&ГВС)
	               |			ТОГДА энргОбъемНачисленийОбороты.СуммаОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.Услуга = &ТН
	               |			ТОГДА энргОбъемНачисленийОбороты.ОбъемУслугиОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.Услуга = &Тепло
	               |			ТОГДА энргОбъемНачисленийОбороты.СуммаОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.Услуга = &Тепло
	               |			ТОГДА энргОбъемНачисленийОбороты.ОбъемУслугиОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ВрТКлючи.КлючПомещения,
	               |	ВрТКлючи.Помещение,
	               |	ВрТКлючи.СтарыйЛС
	               |ИЗ
	               |	ВрТКлючи КАК ВрТКлючи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений.Обороты(
	               |				&ДатаНач,
	               |				&ДатаКон,
	               |				,
	               |				Организация = &Организация
	               |					И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)) КАК энргОбъемНачисленийОбороты
	               |		ПО ВрТКлючи.Организация = энргОбъемНачисленийОбороты.Организация
	               |			И ВрТКлючи.Район = энргОбъемНачисленийОбороты.Район
	               |			И ВрТКлючи.Абонент = энргОбъемНачисленийОбороты.Абонент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВрТКлючи.Организация,
	               |	ВрТКлючи.Район,
	               |	ВрТКлючи.Строение,
	               |	ВрТКлючи.Абонент,
	               |	НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.Услуга = &Тепло
	               |			ТОГДА энргОбъемНачисленийОбороты.СуммаОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.Услуга В (&ГВС)
	               |			ТОГДА энргОбъемНачисленийОбороты.СуммаОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.Услуга = &Тепло
	               |			ТОГДА энргОбъемНачисленийОбороты.ОбъемУслугиОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.Услуга В (&ТН)
	               |			ТОГДА энргОбъемНачисленийОбороты.ОбъемУслугиОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	0,
	               |	ВрТКлючи.КлючПомещения,
	               |	ВрТКлючи.Помещение,
	               |	ВрТКлючи.СтарыйЛС
	               |ИЗ
	               |	ВрТКлючи КАК ВрТКлючи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений.Обороты(
	               |				&ДатаНач,
	               |				&ДатаКон,
	               |				,
	               |				Организация = &Организация
	               |					И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)) КАК энргОбъемНачисленийОбороты
	               |		ПО ВрТКлючи.Организация = энргОбъемНачисленийОбороты.Организация
	               |			И ВрТКлючи.Район = энргОбъемНачисленийОбороты.Район
	               |			И ВрТКлючи.Абонент = энргОбъемНачисленийОбороты.Абонент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВрТКлючи.Организация,
	               |	ВрТКлючи.Район,
	               |	ВрТКлючи.Строение,
	               |	ВрТКлючи.Абонент,
	               |	НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	энргОплатаУслугОбороты.СуммаОборот,
	               |	ВрТКлючи.КлючПомещения,
	               |	ВрТКлючи.Помещение,
	               |	ВрТКлючи.СтарыйЛС
	               |ИЗ
	               |	ВрТКлючи КАК ВрТКлючи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргОплатаУслуг.Обороты(&ДатаНач, &ДатаКон, , Организация = &Организация) КАК энргОплатаУслугОбороты
	               |		ПО ВрТКлючи.Организация = энргОплатаУслугОбороты.Организация
	               |			И ВрТКлючи.Район = энргОплатаУслугОбороты.Район
	               |			И ВрТКлючи.Абонент = энргОплатаУслугОбороты.Абонент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВрТКлючи.Организация,
	               |	ВрТКлючи.Район,
	               |	ВрТКлючи.Строение,
	               |	ВрТКлючи.Абонент,
	               |	НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	энргАвансыПоступившиеОбороты.СуммаОборот,
	               |	ВрТКлючи.КлючПомещения,
	               |	ВрТКлючи.Помещение,
	               |	ВрТКлючи.СтарыйЛС
	               |ИЗ
	               |	ВрТКлючи КАК ВрТКлючи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргАвансыПоступившие.Обороты(&ДатаНач, &ДатаКон, , Организация = &Организация) КАК энргАвансыПоступившиеОбороты
	               |		ПО ВрТКлючи.Организация = энргАвансыПоступившиеОбороты.Организация
	               |			И ВрТКлючи.Район = энргАвансыПоступившиеОбороты.Район
	               |			И ВрТКлючи.Абонент = энргАвансыПоступившиеОбороты.Абонент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ0.Организация КАК Организация,
	               |	ВрТ0.Район КАК Район,
	               |	ВрТ0.МКД КАК МКД,
	               |	ВрТ0.Абонент КАК Абонент,
	               |	ВрТ0.ПериодНачисления КАК РасчетныйПериод,
	               |	СУММА(ВрТ0.Задолженность - ВрТ0.ОплатаЗадолженности) КАК Задолженность,
	               |	СУММА(ВрТ0.НачисленоГВСРуб) КАК НачисленоГВСРуб,
	               |	СУММА(ВрТ0.НачисленоГВСОбъем) КАК НачисленоГВСОбъем,
	               |	СУММА(ВрТ0.НачисленоОтоплениеРуб) КАК НачисленоОтоплениеРуб,
	               |	СУММА(ВрТ0.НачисленоОтоплениеОбъем) КАК НачисленоОтоплениеОбъем,
	               |	СУММА(ВрТ0.ПерерасчетОтоплениеРуб) КАК ПерерасчетОтоплениеРуб,
	               |	СУММА(ВрТ0.ПерерасчетГВСРуб) КАК ПерерасчетГВСРуб,
	               |	СУММА(ВрТ0.ПерерасчетОтоплениеОбъем) КАК ПерерасчетОтоплениеОбъем,
	               |	СУММА(ВрТ0.ПерерасчетГВСОбъем) КАК ПерерасчетГВСОбъем,
	               |	СУММА(ВрТ0.ОплатаЗадолженности) КАК ОплатаЗадолженности,
	               |	ВрТ0.КлючПомещения КАК КлючПомещения,
	               |	ВрТ0.Помещение КАК Помещение,
	               |	энргСтроения.Город КАК Город,
	               |	энргСтроения.Улица КАК Улица,
	               |	энргСтроения.Дом КАК Дом,
	               |	энргСтроения.Корпус КАК Корпус,
	               |	ВрТ0.СтарыйЛС КАК СтарыйЛС,
	               |	ЕСТЬNULL(ВрТ0.МКД.Наименование, """") + "", "" + ЕСТЬNULL(энргПомещения.Наименование, """") КАК Адрес,
	               |	энргСтроения.ДомДляСортировки КАК ДомДляСортировки,
	               |	энргПомещения.НомерДляСортировки КАК НомерДляСортировки,
	               |	ВЫБОР
	               |		КОГДА ВрТ0.Помещение.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	               |			ТОГДА энргПомещения.Наименование
	               |		ИНАЧЕ энргПомещения.Родитель.Наименование
	               |	КОНЕЦ КАК Квартира
	               |ИЗ
	               |	ВрТ0 КАК ВрТ0
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	               |		ПО ВрТ0.Помещение = энргПомещения.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	               |		ПО ВрТ0.МКД = энргСтроения.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТ0.Организация,
	               |	ВрТ0.Район,
	               |	ВрТ0.МКД,
	               |	ВрТ0.Абонент,
	               |	ВрТ0.ПериодНачисления,
	               |	ВрТ0.КлючПомещения,
	               |	ВрТ0.Помещение,
	               |	энргСтроения.Город,
	               |	энргСтроения.Улица,
	               |	энргСтроения.Дом,
	               |	энргСтроения.Корпус,
	               |	энргПомещения.Наименование,
	               |	ВрТ0.СтарыйЛС,
	               |	энргСтроения.ДомДляСортировки,
	               |	энргПомещения.НомерДляСортировки,
	               |	ЕСТЬNULL(ВрТ0.МКД.Наименование, """") + "", "" + ЕСТЬNULL(энргПомещения.Наименование, """"),
	               |	ВЫБОР
	               |		КОГДА ВрТ0.Помещение.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	               |			ТОГДА энргПомещения.Наименование
	               |		ИНАЧЕ энргПомещения.Родитель.Наименование
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДомДляСортировки,
	               |	НомерДляСортировки";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	
	
	Макет	= Отчеты.бестОтчетДляНРИЦПоЛьготникам.ПолучитьМакет("Макет");
	
	Область	= Макет.ПолучитьОбласть("Шапка");	
	ТабДок.Вывести(Область);
	
	НомерСтроки = 1; 
	Пока Выборка.Следующий() Цикл
		Область	= Макет.ПолучитьОбласть("СтрокаТЧ");
		Область.Параметры.НомерСтроки = НомерСтроки;
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Область	= Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.ТекПользователь = Пользователи.ТекущийПользователь();
	ТабДок.Вывести(Область);	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
